app/controllers/promoves_controller.rb

  def index
    @tweet = params["tweet"]
    (@tweeturl = CGI.escape(@tweet)) if @tweet
    @nick = params["nick"]
    @promoters = get_promoters(@tweet) if @tweet
    @count = params["count"]
    @max = User.count
---
SELECT count(*) AS count_all FROM `users`

  def postar

    @tweet = params["tweet"]
    @count = (params["count"] || 0).to_i
    @max = User.count
    result = User.tweet_this(@tweet, @count)
    result_tag = result.collect { |nick,r| "<option>#{nick} - #{r}</option>"  }
---
SELECT count(*) AS count_all FROM `users`
SELECT * FROM `users`

  def seguir
    @nick = params["nick"]
    @count = (params["count"] || 0).to_i
    @max = User.count
    result = User.follow_him(@nick,@count)
    result_tag = result.collect { |nick,r| "<option>#{nick} - #{r}</option>"  }
---
SELECT * FROM `users`