app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 4
---
  def destroy
    @usuario = User.find(params[:id])
    @usuario.destroy